ccsudata/hoverboard-firmware-hack-FOC/hovercar-gd32/usart.c
// 为单个引脚配置 PWM（目前实现 PA3 -> TIM1_CH3）
static void cmd_pwm_pin(const char* pinstr, int hz, int duty) {
    // defaults already applied by caller
    if (hz <= 0 || duty < 0 || duty > 100) {
        USART_SendString("pwm pin usage: pwm PA3 [hz] [duty_percent]\r\n");
        return;
    }

    // parse pin - accept PA3 or A3 etc
    uint32_t port; uint16_t pin;
    if (!parse_pin_string(pinstr, &port, &pin)) {
        USART_Printf("Unsupported pin: %s\r\n", pinstr);
        return;
    }

    // Only implement PA3 -> TIM2_CH4 for now
    if ((uint32_t)GPIOA != port || pin != GPIO_PIN_3) {
        USART_Printf("pwm pin: only PA3 currently supported for single-pin PWM\r\n");
        return;
    }

    uint32_t prescaler;
    uint32_t period;
    if (!calculate_pwm_timer_params(hz, &prescaler, &period)) {
        USART_Printf("Requested frequency out of range: %d Hz\r\n", hz);
        return;
    }

    uint32_t pulse = (((uint32_t)period + 1U) * (uint32_t)duty) / 100U;
    if (pulse > period) {
        pulse = period;
    }

    // Follow sequence: reset/clock enable, enable AF, clear TIM2 remap bits, set PA3 AF_PP
    rcu_periph_reset_enable(RCU_TIMER1RST);
    rcu_periph_reset_disable(RCU_TIMER1RST);
    rcu_periph_clock_enable(RCU_TIMER1);
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_AF);
    volatile uint32_t* AFIO_MAPR = (uint32_t*)0x40010004;
    /* clear TIMER1 remap bits (bits 9:8) so TIM1 channel maps to PA3 */
    *AFIO_MAPR &= ~(3 << 8);

    // configure PA3 as AF push-pull
    gpio_init(GPIOA, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_3);

    // configure TIMER1 CH3 (PA3)
    timer_parameter_struct timer_init_struct;
    timer_oc_parameter_struct oc_init_struct;
    timer_deinit(TIMER1);
    timer_init_struct.prescaler = (uint16_t)prescaler;
    timer_init_struct.alignedmode = TIMER_COUNTER_CENTER_BOTH;
    timer_init_struct.counterdirection = TIMER_COUNTER_UP;
    timer_init_struct.period = (uint16_t)period;
    timer_init_struct.clockdivision = TIMER_CKDIV_DIV1;
    timer_init_struct.repetitioncounter = 0;
    timer_init(TIMER2, &timer_init_struct);

    oc_init_struct.outputstate = TIMER_CCX_ENABLE;
    oc_init_struct.outputnstate = TIMER_CCXN_DISABLE;
    oc_init_struct.ocpolarity = TIMER_OC_POLARITY_HIGH;
    oc_init_struct.ocnpolarity = TIMER_OCN_POLARITY_LOW;
    oc_init_struct.ocidlestate = TIMER_OC_IDLE_STATE_LOW;
    oc_init_struct.ocnidlestate = TIMER_OCN_IDLE_STATE_HIGH;

    timer_channel_output_config(TIMER1, TIMER_CH_3, &oc_init_struct);
    timer_channel_output_mode_config(TIMER1, TIMER_CH_3, TIMER_OC_MODE_PWM1);
    timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_3, (uint16_t)pulse);
    /* enable channel output compare shadow (preload) so CCR updates take effect on update event */
    timer_channel_output_shadow_config(TIMER1, TIMER_CH_3, TIMER_OC_SHADOW_ENABLE);
    /* ensure channel output is enabled */
    timer_channel_output_state_config(TIMER1, TIMER_CH_3, TIMER_CCX_ENABLE);
    timer_auto_reload_shadow_enable(TIMER1);
    timer_update_event_enable(TIMER1);

    timer_enable(TIMER1);

    USART_Printf("PWM pin %s set: %d Hz, duty %d%% (psc=%lu, period=%lu, pulse=%lu)\r\n", pinstr, hz, duty, prescaler, period, pulse);
}

/**
 * @brief 处理命令
 * @param command 命令字符串
 */
static void process_command(const char* command) {
    if (command == NULL || strlen(command) == 0) {
        return;
    }
    
    char cmd_copy[256];
    strncpy(cmd_copy, command, sizeof(cmd_copy) - 1);
    cmd_copy[sizeof(cmd_copy) - 1] = '\0';
    
    // 转换为小写以便比较
    for (int i = 0; cmd_copy[i]; i++) {
        if (cmd_copy[i] >= 'A' && cmd_copy[i] <= 'Z') {
            cmd_copy[i] += 32;
        }
    }
    
    // 命令处理
    if (strcmp(cmd_copy, "help") == 0 || strcmp(cmd_copy, "?") == 0) {
        USART_SendString("\r\n=== HOVERCAR SERIAL COMMANDS ===\r\n");
        USART_SendString("Motor Control:\r\n");
        USART_SendString("  motor enable              - Enable motors\r\n");
        USART_SendString("  motor disable             - Disable motors\r\n");
        USART_SendString("  motor left <pwm>          - Set left motor PWM (-1000~1000)\r\n");
        USART_SendString("  motor right <pwm>         - Set right motor PWM (-1000~1000)\r\n");
        USART_SendString("  motor both <pwm>          - Set both motors PWM (-1000~1000)\r\n");
        USART_SendString("\r\nSystem Status:\r\n");
        USART_SendString("  status                    - Show system status\r\n");
        USART_SendString("  adc                       - Show ADC values\r\n");
        USART_SendString("  battery                   - Show battery voltage\r\n");
        USART_SendString("  current                   - Show motor current\r\n");
        USART_SendString("  speed                     - Show motor speeds\r\n");
        USART_SendString("  hall                      - Show hall sensor states\r\n");
        USART_SendString("\r\nBuzzer Control:\r\n");
        USART_SendString("  beep <n>                  - Beep n times (1-10)\r\n");
        USART_SendString("  buzzer <pattern>          - Play buzzer pattern\r\n");
        USART_SendString("\r\nSystem:\r\n");
        USART_SendString("  reset                     - Reset system\r\n");
        USART_SendString("  help/?                    - Show this help\r\n");
        USART_SendString("================================\r\n");
    }
    
    else if (strncmp(cmd_copy, "motor ", 6) == 0) {
        const char* motor_cmd = command + 6;
        
        if (strncmp(motor_cmd, "enable", 6) == 0) {
            SetMotorsEnable(SET);
            vehicle.enable = SET;
            USART_SendString("Motors enabled\r\n");
        }
        else if (strncmp(motor_cmd, "disable", 7) == 0) {
            SetMotorsEnable(RESET);
            vehicle.enable = RESET;
            USART_SendString("Motors disabled\r\n");
        }
        else if (strncmp(motor_cmd, "left ", 5) == 0) {
            int16_t pwm = parse_pwm_value(motor_cmd + 5);
            SetLeftMotorPWM(pwm);
            USART_Printf("Left motor PWM: %d\r\n", pwm);
        }
        else if (strncmp(motor_cmd, "right ", 6) == 0) {
            int16_t pwm = parse_pwm_value(motor_cmd + 6);
            SetRightMotorPWM(pwm);
            USART_Printf("Right motor PWM: %d\r\n", pwm);
        }
        else if (strncmp(motor_cmd, "both ", 5) == 0) {
            int16_t pwm = parse_pwm_value(motor_cmd + 5);
            SetLeftMotorPWM(pwm);
            SetRightMotorPWM(pwm);
            USART_Printf("Both motors PWM: %d\r\n", pwm);
        }
        else {
            USART_SendString("Motor command: enable|disable|left|right|both\r\n");
        }
    }

