ccsudata/hoverboard-firmware-hack-FOC/hovercar-gd32/usart.c
        else if (strncmp(cmd_copy, "gpio ", 5) == 0) {
            const char* args = command + 5;
            while (*args == ' ') args++;
            if (strncasecmp(args, "read ", 5) == 0) {
                const char* pinstr = args + 5;
                while (*pinstr == ' ') pinstr++;
                cmd_gpio_read(pinstr);
            } else if (strncasecmp(args, "write ", 6) == 0) {
                const char* rest = args + 6;
                while (*rest == ' ') rest++;
                // split pin and value
                char pinbuf[16]; int i=0;
                while (*rest && *rest != ' ' && i < (int)sizeof(pinbuf)-1) pinbuf[i++] = *rest++;
                pinbuf[i] = '\0';
                while (*rest == ' ') rest++;
                cmd_gpio_write(pinbuf, rest);
            } else {
                USART_SendString("gpio commands:\r\n  gpio read PA3\r\n  gpio write PA3 1\r\n");
            }
        }
        else if (cmd_copy[0] == 'r' && cmd_copy[1] == ' ') {
            const char* arg = command + 2;
            while (*arg == ' ') arg++;
            char pinbuf[16]; int i=0;
            while (*arg && *arg != ' ' && i < (int)sizeof(pinbuf)-1) pinbuf[i++] = *arg++;
            pinbuf[i] = '\0';
            if (i == 0) {
                USART_SendString("r usage: r PA3 or r A3\r\n");
            } else {
                cmd_gpio_read(pinbuf);
            }
        }
        else if (cmd_copy[0] == 'w' && cmd_copy[1] == ' ') {
            const char* rest = command + 2;
            while (*rest == ' ') rest++;
            char pinbuf[16]; int i=0;
            while (*rest && *rest != ' ' && i < (int)sizeof(pinbuf)-1) pinbuf[i++] = *rest++;
            pinbuf[i] = '\0';
            while (*rest == ' ') rest++;
            if (i == 0 || *rest == 0) {
                USART_SendString("w usage: w PA3 1\r\n");
            } else {
                cmd_gpio_write(pinbuf, rest);
            }
        }
    
    else if (strcmp(cmd_copy, "status") == 0) {
        USART_SendString("\r\n=== SYSTEM STATUS ===\r\n");
        USART_Printf("State: %d (0=Init,1=Ready,2=Running,3=Error)\r\n", system_state);
        USART_Printf("Battery: %.2fV\r\n", vehicle.battery_voltage);
        USART_Printf("Current: %.2fA\r\n", GetTotalCurrent());
        USART_Printf("Left Speed: %.0f RPM, Hall: %d\r\n", GetLeftMotorSpeed(), left_motor.hall_state);
        USART_Printf("Right Speed: %.0f RPM, Hall: %d\r\n", GetRightMotorSpeed(), right_motor.hall_state);
        USART_Printf("Throttle: %d, Steering: %d\r\n", vehicle.throttle, vehicle.steering);
        USART_Printf("Motors Enabled: %s\r\n", vehicle.enable ? "YES" : "NO");
        USART_SendString("====================\r\n");
    }
    
    else if (strcmp(cmd_copy, "adc") == 0) {
        USART_SendString("\r\n=== ADC VALUES ===\r\n");
        USART_Printf("Battery ADC: %d (counts)\r\n", adc_buffer.battery);
        USART_Printf("Current ADC: %d (counts)\r\n", adc_buffer.current);
        USART_Printf("Temp ADC: %d (counts)\r\n", adc_buffer.temp);
        USART_SendString("==================\r\n");
    }
    
    else if (strcmp(cmd_copy, "battery") == 0) {
        USART_Printf("Battery Voltage: %.2fV\r\n", vehicle.battery_voltage);
        if (vehicle.battery_voltage < BATTERY_DEAD_VOLTAGE) {
            USART_SendString("WARNING: Battery critically low!\r\n");
        } else if (vehicle.battery_voltage < BATTERY_LOW_VOLTAGE) {
            USART_SendString("WARNING: Battery low!\r\n");
        } else {
            USART_SendString("Battery status: Normal\r\n");
        }
    }
    
    else if (strcmp(cmd_copy, "current") == 0) {
        float current = GetTotalCurrent();
        USART_Printf("Motor Current: %.2fA\r\n", current);
        if (current > CURRENT_LIMIT) {
            USART_SendString("WARNING: Current exceeds limit!\r\n");
        }
    }
    
    else if (strcmp(cmd_copy, "speed") == 0) {
        USART_Printf("Left Motor Speed: %.0f RPM\r\n", GetLeftMotorSpeed());
        USART_Printf("Right Motor Speed: %.0f RPM\r\n", GetRightMotorSpeed());
    }
    
    else if (strncmp(cmd_copy, "pwm ", 4) == 0) {
        const char* args = command + 4;
        while (*args == ' ') args++;
        // args may be: all <hz> [duty]  OR  <pin> [hz] [duty]
        if (strncasecmp(args, "all ", 4) == 0) {
            const char* params = args + 4;
            while (*params == ' ') params++;
            // parse hz and optional duty
            char hzbuf[16] = {0}; int i=0;
            while (*params && *params != ' ' && i < (int)sizeof(hzbuf)-1) hzbuf[i++] = *params++;
            hzbuf[i] = '\0';
            while (*params == ' ') params++;
            const char* dutystr = NULL;
            if (*params) dutystr = params;
            cmd_pwm_all(hzbuf, dutystr);
        } else {
            // treat first token as pin
            char pinbuf[16] = {0}; int i=0;
            const char* p = args;
            while (*p && *p != ' ' && i < (int)sizeof(pinbuf)-1) pinbuf[i++] = *p++;
            pinbuf[i] = '\0';
            while (*p == ' ') p++;
            int hz = 1;
            int duty = 50;
            if (*p) {
                char hzbuf[32] = {0}; int j = 0;
                while (*p && *p != ' ' && j < (int)sizeof(hzbuf) - 1) hzbuf[j++] = *p++;
                hzbuf[j] = '\0';
                if (hzbuf[0]) {
                    hz = atoi(hzbuf);
                }
                while (*p == ' ') p++;
                if (*p) {
                    duty = atoi(p);
                }
            }
            if (pinbuf[0]) cmd_pwm_pin(pinbuf, hz, duty);
            else USART_SendString("pwm commands:\r\n  pwm all <hz> [duty_percent]\r\n  pwm PA3 [hz] [duty_percent]\r\n");
        }
    }
    
    else if (strcmp(cmd_copy, "hall") == 0) {
        uint8_t left_u = read_hall_pin(LEFT_HALL_U_PORT, LEFT_HALL_U_PIN);
        uint8_t left_v = read_hall_pin(LEFT_HALL_V_PORT, LEFT_HALL_V_PIN);
        uint8_t left_w = read_hall_pin(LEFT_HALL_W_PORT, LEFT_HALL_W_PIN);
        uint8_t left_raw = (left_u << 0) | (left_v << 1) | (left_w << 2);

