ccsudata/hoverboard-firmware-hack-FOC/hovercar-gd32/usart.c
        uint8_t right_u = read_hall_pin(RIGHT_HALL_U_PORT, RIGHT_HALL_U_PIN);
        uint8_t right_v = read_hall_pin(RIGHT_HALL_V_PORT, RIGHT_HALL_V_PIN);
        uint8_t right_w = read_hall_pin(RIGHT_HALL_W_PORT, RIGHT_HALL_W_PIN);
        uint8_t right_raw = (right_u << 0) | (right_v << 1) | (right_w << 2);

        USART_SendString("\r\n=== HALL SENSOR STATES ===\r\n");
        USART_SendString("Left Hall pins:\r\n");
        print_hall_pin_state("LEFT_HALL_U", LEFT_HALL_U_PIN, left_u);
        print_hall_pin_state("LEFT_HALL_V", LEFT_HALL_V_PIN, left_v);
        print_hall_pin_state("LEFT_HALL_W", LEFT_HALL_W_PIN, left_w);
        USART_Printf("Left Raw State: 0x%02X (%d)\r\n", left_raw, left_raw);
        USART_Printf("Left Motor Position: %d\r\n", left_motor.position);
        USART_SendString("\r\nRight Hall pins:\r\n");
        print_hall_pin_state("RIGHT_HALL_U", RIGHT_HALL_U_PIN, right_u);
        print_hall_pin_state("RIGHT_HALL_V", RIGHT_HALL_V_PIN, right_v);
        print_hall_pin_state("RIGHT_HALL_W", RIGHT_HALL_W_PIN, right_w);
        USART_Printf("Right Raw State: 0x%02X (%d)\r\n", right_raw, right_raw);
        USART_Printf("Right Motor Position: %d\r\n", right_motor.position);
    }
    
    else if (strncmp(cmd_copy, "beep", 4) == 0) {
        const char* param = command + 4;
        while (*param == ' ') param++;
        int beeps = atoi(param);
        if (beeps > 0 && beeps <= 10) {
            for (int i = 0; i < beeps; i++) {
                beep_pattern(1);
                Delay(100);
            }
            USART_Printf("Beep x%d\r\n", beeps);
        } else {
            USART_SendString("Beep count: 1-10\r\n");
        }
    }
    
    else if (strncmp(cmd_copy, "buzzer", 6) == 0) {
        const char* param = command + 6;
        while (*param == ' ') param++;
        int pattern = atoi(param);
        if (pattern > 0 && pattern <= 10) {
            beep_pattern(pattern);
            USART_Printf("Buzzer pattern: %d\r\n", pattern);
        } else {
            USART_SendString("Buzzer pattern: 1-10\r\n");
        }
    }
    
    else if (strcmp(cmd_copy, "reset") == 0) {
        USART_SendString("System reset in 1 second...\r\n");
        Delay(1000);
        NVIC_SystemReset();
    }
    
    else {
        USART_Printf("Unknown command: '%s'\r\n", command);
        USART_SendString("Type 'help' for available commands\r\n");
    }
}

// ============================================
// 中断处理函数
// ============================================

/**
 * @brief USART2 中断处理 (调试串口)
 */
void USART2_IRQHandler(void) {
    if (usart_interrupt_flag_get(DEBUG_USART, USART_INT_FLAG_RBNE) != RESET) {
        uint8_t ch = usart_data_receive(DEBUG_USART);
        process_received_char(ch);
        usart_interrupt_flag_clear(DEBUG_USART, USART_INT_FLAG_RBNE);
    }
    
    if (usart_interrupt_flag_get(DEBUG_USART, USART_INT_FLAG_TC) != RESET) {
        usart_interrupt_flag_clear(DEBUG_USART, USART_INT_FLAG_TC);
    }
}

// ============================================
// 重定向printf到串口
// ============================================

#ifdef __GNUC__
// 对于GCC编译器
int _write(int file, char *ptr, int len) {
    (void)file;
    USART_SendData((uint8_t*)ptr, len);
    return len;
}
#else
// 对于其他编译器
int fputc(int ch, FILE *f) {
    (void)f;
    usart_data_transmit(DEBUG_USART, (uint8_t)ch);
    while (usart_flag_get(DEBUG_USART, USART_FLAG_TBE) == RESET);
    return ch;
}
#endif